; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	infrared1 - mode
	image0 - mode
	GroundStation4 - direction
	Star1 - direction
	GroundStation9 - direction
	Star2 - direction
	Star8 - direction
	GroundStation7 - direction
	Star5 - direction
	GroundStation0 - direction
	Star3 - direction
	Star6 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Star13 - direction
	Star14 - direction
	Planet15 - direction
)
(:init
	(supports instrument0 infrared1)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Phenomenon12)
	(supports instrument1 image0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation9)
	(calibration_target instrument3 Star2)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star13)
	(supports instrument4 infrared1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star14)
	(supports instrument5 image0)
	(calibration_target instrument5 GroundStation0)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star3)
	(supports instrument6 infrared1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation7)
	(calibration_target instrument6 Star8)
	(supports instrument7 image0)
	(supports instrument7 infrared1)
	(calibration_target instrument7 GroundStation0)
	(calibration_target instrument7 Star5)
	(supports instrument8 image0)
	(calibration_target instrument8 Star6)
	(calibration_target instrument8 Star3)
	(on_board instrument6 satellite4)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation4)
	(pointing satellite2 GroundStation7)
	(pointing satellite4 Star2)
	(have_image Star10 infrared1)
	(have_image Star11 infrared1)
	(have_image Phenomenon12 infrared1)
	(have_image Star13 infrared1)
	(have_image Star14 image0)
	(have_image Planet15 image0)
))

)

; plan
1. (turn_to satellite1 star3 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star3)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 star10 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star10)
   goals met: 0 of 9
5. (take_image satellite1 star10 instrument1 infrared1)
   added: (have_image star10 infrared1)
   goals met: 1 of 9
6. (turn_to satellite1 planet15 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet15)
   goals met: 1 of 9
7. (take_image satellite1 planet15 instrument1 image0)
   added: (have_image planet15 image0)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon12 planet15)
   deleted: (pointing satellite1 planet15)
   added: (pointing satellite1 phenomenon12)
   goals met: 2 of 9
9. (turn_to satellite0 groundstation4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 groundstation4)
   goals met: 3 of 9
10. (take_image satellite1 phenomenon12 instrument1 infrared1)
   added: (have_image phenomenon12 infrared1)
   goals met: 4 of 9
11. (turn_to satellite1 star11 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 star11)
   goals met: 4 of 9
12. (take_image satellite1 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 5 of 9
13. (turn_to satellite1 star13 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star13)
   goals met: 5 of 9
14. (take_image satellite1 star13 instrument1 infrared1)
   added: (have_image star13 infrared1)
   goals met: 6 of 9
15. (turn_to satellite1 star14 star13)
   deleted: (pointing satellite1 star13)
   added: (pointing satellite1 star14)
   goals met: 6 of 9
16. (take_image satellite1 star14 instrument1 image0)
   added: (have_image star14 image0)
   goals met: 7 of 9
17. (turn_to satellite2 groundstation7 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 groundstation7)
   goals met: 8 of 9
18. (turn_to satellite4 star2 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 star2)
   goals met: 9 of 9
